In [1]:
import pandas as pd

In [3]:
pew = pd.read_csv('pew.csv')
pew.head()

,religion,<$10k,$10-20k,$20-30k,$30-40k,$40-50k,$50-75k,$75-100k,$100-150k,>150k,Don't know/refused
0,Agnostic,27,34,60,81,76,137,122,109,84,96
1,Atheist,12,27,37,52,35,70,73,59,74,76
2,Buddhist,27,21,30,34,33,58,62,39,53,54
3,Catholic,418,617,732,670,638,1116,949,792,633,1489
4,Don’t know/refused,15,14,15,11,10,35,21,17,18,116

In [6]:
pew_tidy=pew.melt(id_vars='religion',var_name='income',value_name='count')

In [7]:
pew_tidy.head()

             religion income  count
0            Agnostic  <$10k     27
1             Atheist  <$10k     12
2            Buddhist  <$10k     27
3            Catholic  <$10k    418
4  Don’t know/refused  <$10k     15

### Data Cleaning
* Importing the Dataset(csv)
* Observe the Data Set
    * Identifying the rows/columns and their relation
    * Indetifying the index column(Primary key column)
    * Check if there are any duplicate columns
    * which rows to be skipped
* Assign the Index column (To avoid creation of new index column)
* Skip Irrelevant rows (to avoid display of index row)
* Drop duplicate/irrelevant columns
*

In [8]:
import pandas as pd
filepath='DataFiles\Assignment2\olympics.csv'
df = pd.read_csv(filepath, index_col = 0,skiprows = 1)
df.index
df.columns
#Data Cleaning - Fixing Row Index , Renaming columns ,Eliminating the unwanted rows
for column in df.columns:
#     print(column[0:2])
    if column[0:2] == '01':
        df.rename(columns={column:'Gold'+column[4:]},inplace=True)
    if column[0:2] == '02':
        df.rename(columns={column:'Silver'+column[4:]},inplace=True)
    if column[:2] == '03':
        df.rename(columns={column:'Bronze'+column[4:]},inplace=True)
    if column[:1] == '№':
        df.rename(columns={column:'#'+column[1:]},inplace=True)
names = df.index.str.split('\s\(')
df.index = names.str[0]
df['ID'] = names.str[1].str[:3]
df.drop('Totals',axis = 0,inplace=True)
df.index[0]

'Afghanistan'

### Data Retrieval
* Index Column
* Column names
* To Access the Any column
* To access the Any row
* Single Cell Data

In [18]:
df.index #Returns the index column
df.columns # Returns the column names or first row 
df['Total'] # Returns the Total column -->Total medals in summer
df['Total.1'] # Returns the Total1.1 column
df.head(1)# Returns sub data frame with the specified row
df.loc['India'] #Returns a single row
df.index[1]# Returns the second country name
df['Gold'][4]#Returns the Gold medals won by the fifth country(First column)
df.iloc[4][1]# Returns the Gold medals won by the fifth country(First row)
df.loc['India'][-2]# Returns the Total medals won by India

26

In [20]:
#Display the Combined Total 
df['Combined total']

Afghanistan                            2
Algeria                               15
Argentina                             70
Armenia                               12
Australasia                           12
Australia                            480
Austria                              304
Azerbaijan                            26
Bahamas                               12
Bahrain                                1
Barbados                               1
Belarus                               90
Belgium                              147
Bermuda                                1
Bohemia                                4
Botswana                               1
Brazil                               108
British West Indies                    2
Bulgaria                             220
Burundi                                1
Cameroon                               5
Canada                               449
Chile                                 13
China                                526
Colombia                              19
Costa Rica                             4
Ivory Coast                            1
Croatia                               34
Cuba                                 209
Cyprus                                 1
                                    ...
Spain                                133
Sri Lanka                              2
Sudan                                  1
Suriname                               2
Sweden                               627
Switzerland                          323
Syria                                  3
Chinese Taipei                        21
Tajikistan                             3
Tanzania                               2
Thailand                              24
Togo                                   1
Tonga                                  1
Trinidad and Tobago                   18
Tunisia                               10
Turkey                                88
Uganda                                 7
Ukraine                              122
United Arab Emirates                   1
United States                       2681
Uruguay                               10
Uzbekistan                            21
Venezuela                             12
Vietnam                                2
Virgin Islands                         1
Yugoslavia                            87
Independent Olympic Participants       3
Zambia                                 2
Zimbabwe                               8
Mixed team                            17
Name: Combined total, Length: 146, dtype: int64

In [28]:
df['# Summer'][9]

8

In [30]:
df['Combined total'][-1]

17

In [35]:
df.loc['United States']['Gold.2']

1072

In [41]:
abs((df.loc['United States']['Gold']) - (df.loc['China']['Gold']))

775

In [43]:
df['Gold.1'].max()

118

In [45]:
sum(df['Gold'])

4809

In [50]:
df[df['Gold']==df['Gold'].max()].index[0]

'United States'

In [54]:
df[df['Total']==df['Total'].max()]

,# Summer,Gold,Silver,Bronze,Total,# Winter,Gold.1,Silver.1,Bronze.1,Total.1,# Games,Gold.2,Silver.2,Bronze.2,Combined total,ID
United States,26,976,757,666,2399,22,96,102,84,282,48,1072,859,750,2681,USA

In [55]:
df[df['Total']==df['Total'].max()].index[0]

'United States'

In [60]:
df[df['Combined total']==df['Combined total'].max()].index[0]

'United States'

In [ ]:
#which country has the biggest diffrence between 
#  total medals in summer and winter

In [ ]:
# What are the countries got the equal total number of medals?